{"version": "https://jsonfeed.org/version/1", "title": "Practicalli Personal Journal", "home_page_url": "https://practical.li/journal/", "feed_url": "https://practical.li/journal/feed_json_created.json", "description": "Daily journal of thoughts and experiences", "icon": "https://github.com/practicalli/graphic-design/blob/live/logos/practicalli-logo.png?raw=true", "authors": [{"name": "Practicalli"}], "language": "en", "items": [{"id": "https://practical.li/journal/the-king-is-dead-long-live-the-king/", "url": "https://practical.li/journal/the-king-is-dead-long-live-the-king/", "title": "The king is dead, long live the king", "content_html": "<p>!!! QUOTE\n    You are only a leader if people are willing to follow</p>\n<p>Its hard to shake the feeling that I have failed at the current role, but I will continue to understand what is happening and where I can add value.  However, its too easy to feel I am simply not needed and in an exceptional case, simply not wanted.</p>", "image": "https://practical.li/journal/assets/images/social/the-king-is-dead-long-live-the-king.png", "date_published": "2024-11-11T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["leadership", "practicalli"]}, {"id": "https://practical.li/journal/the-hardest-part-of-life-is-people/", "url": "https://practical.li/journal/the-hardest-part-of-life-is-people/", "title": "The hardest part of life is people", "content_html": "<p>!!! QUOTE\n    It was the best of times, it was the worst of times.</p>\n<p>My feelings of disappointed with my current commercial role are returning to the forefront of my mind.  Many aspects of the role and company seem to be clear in peoples minds but not always effectively shared. I think I understand the role and then something else happens that makes me feel I don't. I believe something will need to change soon for the benefit of all.</p>\n<p>There have been a few highlights with the role, but I expected more of myself and the company. I do set high expectations for myself, although have learned to be more kind about what I can realistically achieve and 'which battles to fight' (figuratively speaking of course).</p>\n<p>During this engagement I have continually reset my expectations about what could be achieved and what I could realistically achieve.  There are a couple of peers where there has been conflict without understanding of why I am seen as the cause.  I have tried to explore but if people do have issues with me its not clearly being communicated to me.</p>\n<p>In hindsight, many opportunities to get support from my manger and peers were missed.  Mostly as we had so many challenges to discuss and partly due to pressures of delivery.</p>\n<p>When a person doesn't have clarity around a problem then there is very little they can do to resolve or adapt.</p>\n<p>A self-reflection review is in progress and its is a good opportunity to take my own time to reflect on my current role and if its still the right fit for me.</p>", "image": "https://practical.li/journal/assets/images/social/the-hardest-part-of-life-is-people.png", "date_published": "2024-11-04T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/back-to-work/", "url": "https://practical.li/journal/back-to-work/", "title": "Back to work", "content_html": "<p>Busy week at work getting ready for a new team member.  I spent Friday afternoon building up a relationship and getting accustom to spending time working together.  Several weeks of work had been done to get ready for the new starter.</p>\n<p>One of the interesting challenges for anyone starting a new job is to ensure too much enthusiasm doesnt lead to missing important steps.  It will be a good first check-in with the new starter to see if they have been too enthusiastic or taken a more measured approach.</p>\n<p>Current issues</p>\n<ul>\n<li><strong>DONE</strong> <a href=\"https://github.com/practicalli/clojure-cli-config/issues/87\">security: add clj-watson to clojure cli config</a></li>\n</ul>", "image": "https://practical.li/journal/assets/images/social/back-to-work.png", "date_published": "2024-10-28T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/holiday-in-paramout-plus/", "url": "https://practical.li/journal/holiday-in-paramout-plus/", "title": "Holiday in Paramout Plus", "content_html": "<p>After being ill for most of the week I am finally starting to enjoying my second week of holiday, binging on some Paramount+ and having a lazy Sunday enjoying the extra hour in bed after the end of summer time.</p>\n<p>Updating Practicalli Journal and Clojure CLI Config repositories, fixing links and markdown issues from the Megalinter reports.</p>\n<p>Updating to Megalinter 0.8.1 GitHub action on Practicalli repositories as I work on them.  The upgrade will include each repository in the Grafana dashboards for Practicalli projects.</p>\n<p>Issues</p>\n<ul>\n<li><strong>DOING</strong> <a href=\"https://github.com/practicalli/clojure-cli-config/issues/87\">security: add clj-watson to clojure cli config</a></li>\n<li><strong>DOING</strong> zsh environment varaibles not loading into jvm</li>\n</ul>", "image": "https://practical.li/journal/assets/images/social/holiday-in-paramout-plus.png", "date_published": "2024-10-21T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/hacking-on-practicalli-content/", "url": "https://practical.li/journal/hacking-on-practicalli-content/", "title": "Hacking on Practicalli content", "content_html": "<p>I am enjoying my 2 week at home vacation (stay-cation) and have already completely rewired my desk, laptops, Monitors and NAS storage devices on the electronic standing desk.  It feels a lot more organised and easier to find everything as everything has its place.</p>\n<p>Now I can focus on getting lots of <a href=\"#practicalli\">Practicalli content done</a> (as well as catch up with shows on Paramount+ and maybe a little Polybus on the Playstation4 VR headset)</p>\n<p>I am interested in switching to the Hyprland, although its changing fast so I dug out an older laptop and installed Arch Linux with Hyprland using the <code>archinstall</code> tool.  Unfortunately the laptop I used doesnt seem to support Hyprland or something is missing from the install.</p>\n<p>I am taking a stay-cation as I am still recovering from Covid and the weather is also quite grim.  I am getting out for walks each day and on Friday I completed a short cycle ride as it was nice and sunny outside.  Unfortunately my chest started feeling like it was on fire a few minutes into the ride, so I slowed down and limited myself to 10km.</p>\n<p>I was feeling really sleepy after the ride, so I kept myself awake by sorting through the cardboard boxes in my attic.  Many boxes made the ultimate sacrifice (for an uncluttered house) and went to the recycling service.</p>", "image": "https://practical.li/journal/assets/images/social/hacking-on-practicalli-content.png", "date_published": "2024-10-14T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["neovim", "practicalli", "practicalli"]}, {"id": "https://practical.li/journal/practicalli-content-planning/", "url": "https://practical.li/journal/practicalli-content-planning/", "title": "Practicalli content planning", "content_html": "<p>Hyprland promises to be a great experience but also a potential time drain, so will save most of the investigation and further configuration until the winter break (or if I need a little distraction of the new shiny for motivation).</p>\n<p>Taking two weeks off from work and have some time to work on Practicalli content.</p>", "image": "https://practical.li/journal/assets/images/social/practicalli-content-planning.png", "date_published": "2024-10-07T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "megalinter", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/linux-wayland-compositor--hyprland/", "url": "https://practical.li/journal/linux-wayland-compositor--hyprland/", "title": "Linux Wayland Compositor & Hyprland", "content_html": "<p>A friend recommended <a href=\"https://hyprland.org/\">Hyprland window manager</a> which is similar to i3 window manager I currently used, but more optomised for the Wayland compositor.</p>\n<p>Practicalli currently uses Regolith Desktop, a complete Linux desktop that leverages Gnome and i3 tiling window manager.</p>\n<p>Regolith Desktop provides quite a rich experience using the <code>regolith-desktop</code> Debian package.  I have not had much success with Regolith when running with Wayland (specifically Sway).</p>\n<p>Sway compositor is an implementation of wayland for i3 window manager.  Some of my applications do not see to play nice with Sway (e.g. chromium browser scrolling, simplescreenrecorder cannot run on wayland).</p>\n<p>OBS did seem to work okay on wayland, given a sufficiently recent version.</p>\n<p>A friend recommended Hyprland, a tiling compositor that provides the latest Wayland features and lots of eye candy.  Its pretty easy to setup on Debian, although there is much additional setup before it would be comparable to Regolith Desktop.</p>\n<p>Neovim Grug plugin is being considered as an alternative to the Spectre tool for search and replacing across a project.</p>", "image": "https://practical.li/journal/assets/images/social/linux-wayland-compositor--hyprland.png", "date_published": "2024-09-30T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["debian", "hyprland", "linux", "neovim", "practicalli", "slack"]}, {"id": "https://practical.li/journal/here-comes-the-rain/", "url": "https://practical.li/journal/here-comes-the-rain/", "title": "Here Comes The Rain", "content_html": "<p>Thunderstorms abound which will be good for the vegetables growing in my garden (beetroot, courgettes, parsnips and onions)</p>", "image": "https://practical.li/journal/assets/images/social/here-comes-the-rain.png", "date_published": "2024-09-23T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "debian", "practicalli"]}, {"id": "https://practical.li/journal/megalinter-grafana-dashboards/", "url": "https://practical.li/journal/megalinter-grafana-dashboards/", "title": "MegaLinter Grafana Dashboards", "content_html": "<p>As Practicalli projects are being updated to Megalinter version 8 it seemed a good time to try the Megalinter API reporter to publish data to use with Grafana.  A chance to learn more about creating Dashboards and if Grafana is any easier than DataDog.</p>\n<p>!!! WARNING \"Megalinter not publishing logs on Grafana yet\"\n    Unfortunately I havent been able to make the Megalinter API Reporter work with this journal project, Clojure CLI Config or a new megalinter-test project I created.</p>\n<p>Health is a little better after resting over the weekend, although still have lots of symptoms.</p>\n<p>!!! EXAMPLE \"Megalinter Grafana dashboard example project\"\n    <a href=\"https://github.com/practicalli/megalinter-test\">:fontawesome-brands-github: Practicalli Megalinter-Test</a>{target=_blank .md-button}</p>\n<pre><code>NOTE: I am trying to diagnose why this project does not seem to be sending logs to Grafana.\n</code></pre>", "image": "https://practical.li/journal/assets/images/social/megalinter-grafana-dashboards.png", "date_published": "2024-09-16T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["dashboard", "debian", "github", "grafana", "megalinter", "practicalli"]}, {"id": "https://practical.li/journal/megalinter-8-and-monthly-version-updates/", "url": "https://practical.li/journal/megalinter-8-and-monthly-version-updates/", "title": "Megalinter 8 and monthly version updates", "content_html": "<p>Megalinter updates to version 8 using the megalinter runner tool, adding a Makefile task to simplify the command line (so I dont have to remember the command).</p>\n<p>Material for MkDocs provides a nice diff view using the <code>diff</code> language for a code block. Add or copy a diff into the code block, ensuring the <code>-</code> and <code>+</code> signs are included and the diff is automatically highlighted.  See the <a href=\"#megalinter\">Megalinter</a> section of this post for an example.</p>\n<p>Feeling quite low the last few weeks, mostly due to continued Covid symptoms, low blood oxygen and lack of energy.  Waking up I feel like I have experienced carbon dioxide poisoning (which I have experienced working on a mushroom farm).  I am disorientated, dizzy and feel quite terrible.</p>", "image": "https://practical.li/journal/assets/images/social/megalinter-8-and-monthly-version-updates.png", "date_published": "2024-09-09T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/clojure-112-and-learn-clojure-book/", "url": "https://practical.li/journal/clojure-112-and-learn-clojure-book/", "title": "Clojure 1.12 and Learn Clojure book", "content_html": "<p>Work on Practicalli Learn Clojure book, a practical guide to getting comfortable working with Clojure.  A full guide to using Clojure is in the Practicalli Clojure book.</p>\n<p>Added RSS feed for Journal, although I feel that all these blogs should be merged into the <a href=\"https://practical.li/blog\">https://practical.li/blog</a> site for a single collection or articles.  The articles can be categorised to keep them separate.</p>\n<p>Health is still recovering from a little Covid symptoms.  Took Monday off work and slept most of the day.</p>", "image": "https://practical.li/journal/assets/images/social/clojure-112-and-learn-clojure-book.png", "date_published": "2024-09-02T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli", "practicalli"]}, {"id": "https://practical.li/journal/clojure-specific-which-key-menu/", "url": "https://practical.li/journal/clojure-specific-which-key-menu/", "title": "Clojure specific Which-key menu", "content_html": "<p>Whilst looking for a Neovim way to have language specific configuration, I discovered the <code>after/ftplugin</code> approach.  This allows a configuration to be loaded when a buffer is switched to a specific language.</p>", "image": "https://practical.li/journal/assets/images/social/clojure-specific-which-key-menu.png", "date_published": "2024-08-19T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["neovim", "practicalli"]}, {"id": "https://practical.li/journal/tetris-and-the-fall-of-the-ussr-and-neovim-conjure-menu/", "url": "https://practical.li/journal/tetris-and-the-fall-of-the-ussr-and-neovim-conjure-menu/", "title": "Tetris and the fall of the USSR (and Neovim Conjure menu)", "content_html": "<p>Enjoyed watching the <a href=\"https://en.wikipedia.org/wiki/Tetris\">Tetris movie</a> and wondered just how much was real and dramatised. Reading the background to the game it does seem the main thread of the movie is accurate, with perhaps some additional dramatic effect.  It was a very enjoyable movie regardless.</p>\n<p>I do remember the break-up of the USSR when it happened, first with Gorbachev as leader and then Boris Yeltsin.  Then the Oligarchs (super rich) moved in and supported a more draconian leader in Putin (assumingly so they could keep hold of all their money).</p>\n<p>I also remember Robert Maxwell as a disgraced billionaire that stole from his own company and mysteriously vanished from his luxury yacht.</p>", "image": "https://practical.li/journal/assets/images/social/tetris-and-the-fall-of-the-ussr-and-neovim-conjure-menu.png", "date_published": "2024-08-12T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/http-message-signing-investigation/", "url": "https://practical.li/journal/http-message-signing-investigation/", "title": "HTTP Message Signing investigation", "content_html": "<p>API Security is typically managed by issuing a token for authentication. Only requests that include a valid token are processed, any requests with an expired or missing token are rejected.  HTTP code 401 Unauthorised error message is returned for rejected requests.</p>\n<p>When dealing with very sensitive data and higher risk actions common in financial services, additional security mechanisms are required.  So I have been looking at mTLS and <a href=\"#http-message-signatures\">HTTP Message Signatures</a> (RFC9421) this week.</p>\n<p>Not going to be a productive week as I am full of flu.  Given the time of year its most likely a variant of Covid.  So far I've only had a headache, congested chest / nose / ears and some fatigue.  Taking lots of paracetamol and drinking lots of water to try keep the inflammation at bay.</p>\n<p>Edit: I was mostly okay by the weekend, although still had a sore throat and coughing.</p>", "image": "https://practical.li/journal/assets/images/social/http-message-signing-investigation.png", "date_published": "2024-08-05T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/a-very-hot-week/", "url": "https://practical.li/journal/a-very-hot-week/", "title": "A very hot week", "content_html": "<p>Its a bit too hot for rational thought... and caught flu at the end of the week, so not much happened.</p>\n<p>Time for some project maintenance courtesy of the <a href=\"https://practical.li/engineering-playbook/continuous-integration/github/workflows/practicalli/#scheduled-version-check\">scheduled version GitHub workflow</a>, run at the start of each month.</p>", "image": "https://practical.li/journal/assets/images/social/a-very-hot-week.png", "date_published": "2024-07-29T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/data-driven-components--neovim-updates/", "url": "https://practical.li/journal/data-driven-components--neovim-updates/", "title": "Data Driven Components & Neovim updates", "content_html": "<p><a href=\"https://github.com/practicalli/astro\">:fontawesome-brands-github: Practicalli Astro</a> config for Clojure development with Neovim initial release.</p>\n<p>Presented my experiences with Component libraries to London Clojurians this week, specifically comparing Integrant and Donut-party/system.  I discussed my Service REPL workflow to show the benefits and constraints of these two libraries.</p>\n<p>For component libraries to work well, then code should be reloadable.  There are a few parts of the Clojure language that do make it harder to reload code, (deftype, defrecord, etc), although I tend to avoid those parts anyway.</p>\n<p>Issues this week</p>\n<p><a href=\"https://github.com/practicalli/astro\">:fontawesome-brands-github: practicalli/astro</a>:</p>\n<ul>\n<li>DONE <a href=\"https://github.com/practicalli/astro/issues/10\">:fontawesome-brands-github: search: find text pattern in specific files and file types</a></li>\n<li>DONE <a href=\"https://github.com/practicalli/astro/issues/9\">:fontawesome-brands-github: config: capitalise Leader &amp; LocalLeader - vim convention</a></li>\n<li>DONE <a href=\"https://github.com/practicalli/astro/issues/8\">:fontawesome-brands-github: plugin: conjure sub-menu key labels in which-key version 3</a></li>\n<li>DONE <a href=\"https://github.com/practicalli/astro/issues/7\">:fontawesome-brands-github: plugin: spectre moved to search category in astrocommunity</a></li>\n<li>DONE <a href=\"https://github.com/practicalli/astro/issues/6\">:fontawesome-brands-github: plugin: better-escape.nvim rewrite required config change</a></li>\n</ul>", "image": "https://practical.li/journal/assets/images/social/data-driven-components--neovim-updates.png", "date_published": "2024-07-22T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["astro", "clojure", "clojure", "donut", "integrant", "neovim"]}, {"id": "https://practical.li/journal/montly-clojure-library-updates/", "url": "https://practical.li/journal/montly-clojure-library-updates/", "title": "Montly Clojure Library updates", "content_html": "<p>Exploring the mysteries of the Bazel build tool at work.  Whilst technically its a very powerful tool it really lacks a good developer experience.</p>\n<p>Its supposed to be a more powerful make, although ironically I use a <code>Makefile</code> so that Bazel is much easier to use.</p>\n<p>It could be an opportunity to use Babashka, but that would be more work than using a Makefile as I dont have much Babashka experience.</p>", "image": "https://practical.li/journal/assets/images/social/montly-clojure-library-updates.png", "date_published": "2024-07-15T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["bazel", "clojure", "make", "practicalli"]}, {"id": "https://practical.li/journal/monthly-library-updates-for-practicalli-projects/", "url": "https://practical.li/journal/monthly-library-updates-for-practicalli-projects/", "title": "Monthly Library Updates for Practicalli Projects", "content_html": "<p>Monthly updates for Practicalli projects, driven by a scheduled version GitHub workflow that uses antq to report on project library dependencies and GitHub action library versions.</p>\n<ul>\n<li>Release: Clojure CLI Config - 2024-07-07</li>\n<li>Release: Project Templates - 2024-07-07</li>\n</ul>\n<p>Which-key version 3 released, fixing localleader issue and providing a horizontal menu option.</p>", "image": "https://practical.li/journal/assets/images/social/monthly-library-updates-for-practicalli-projects.png", "date_published": "2024-07-08T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/flexiana-interview/", "url": "https://practical.li/journal/flexiana-interview/", "title": "Flexiana Interview", "content_html": "<p>I enjoyed the interview with Flexiana team this week, they are very friendly and it we had some very interesting discussions.  I included my interview preparation notes which were mosty the same as shared in the video.</p>\n<p>A blip with Emacs 29.4 release stopped the which-key menu from showing when in a major mode.  This affected both the leader and local leader key.  Within a couple of hours the issue was resolved before I really figured out the cause. I installed Emacs 29.4 on Termux to replicate an issue that was reported in the #spacemacs channel of the Clojurians Community slack community.</p>", "image": "https://practical.li/journal/assets/images/social/flexiana-interview.png", "date_published": "2024-07-01T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/updating-practicalli-neovim/", "url": "https://practical.li/journal/updating-practicalli-neovim/", "title": "Updating Practicalli Neovim", "content_html": "<p><a href=\"https://github.com/practicalli/astro\">Practicalli Astro config</a> is not very stable so its time to refactor the <a href=\"https://practical.li/neovim\">Practicalli Neovim</a> book now that the <a href=\"https://github.com/practicalli/astro\">Practicalli Astro</a> configuration is established.</p>", "image": "https://practical.li/journal/assets/images/social/updating-practicalli-neovim.png", "date_published": "2024-06-24T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["astronvim", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/conjure-lsp-bug--cycling-video-editing/", "url": "https://practical.li/journal/conjure-lsp-bug--cycling-video-editing/", "title": "Conjure LSP bug & Cycling video editing", "content_html": "<p>Updated to Kitty 0.35.1 easily and switching between dark and light themes working instantly again.</p>\n<p>Diagnosed a 'new buffer' error with Conjure when using Neovim 0.9.0 and when opening a Clojure file, although everything works well in 0.10.0.  EDIT: The maintainer added a fix to the <code>develop</code> branch for testing.</p>\n<p><a href=\"https://github.com/Olical/conjure/issues/582\">#582 REVIEW: Conjure throws new Buffer error</a>{target=_blank .md-button}</p>\n<p>Video editing of footage taken by the front mounted camera on my bicycle. Advanced cycle training at Gravesend at the start of June.\n<a href=\"https://youtu.be/7PnCrLdTmUo\">:fontawesome-brands-youtube: Bigfoot Cycling Club at Gravesent Cyclopark</a></p>\n<p>Took a few days away from the computer to work on the garden as its nice and sunny.  A mostly sunny ride on Saturday around the Kent countryside.</p>", "image": "https://practical.li/journal/assets/images/social/conjure-lsp-bug--cycling-video-editing.png", "date_published": "2024-06-17T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "conjure", "cycling", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/neovim-on-termux-enhancements/", "url": "https://practical.li/journal/neovim-on-termux-enhancements/", "title": "Neovim on Termux enhancements", "content_html": "<p>More Neovim updates and getting closer to a release of Practicalli Astro-config</p>\n<p>I have been using Neovim (and Emacs) on Termux, so I can code on my Android tablet or Android smart phone.  I typically use an external keyboard (e.g. Keyboard.io Atreus or Model100), especially when considerable typing is involved.</p>\n<p>As the hardware and compilation tooling is different for Android Linux (compared to amd64 linux) the Clojure and Lua LSP language servers would not install via the Mason manager.  As these two languages are in the top 3 languages I use, then it is a great boost to get these servers working locally and configuring Neovim to use them instead.</p>\n<p>I use the <code>date</code> command when I had a need to tweak the time on my Linux computer, saves launching the <strong>Settings</strong> app and using the mouse.</p>\n<p>!!! INFO \"Timezones made easy\"\n    <a href=\"https://time.is/\">time.is</a> makes figuring out timezones really simple.  See the current time in any timezone across the world.</p>\n<pre><code>time.is very useful for events where people attend from different timezones.  Set the local time and share a link for others who will see the event time in their own timezone.\n</code></pre>\n<h2>Neovim</h2>\n<p>I'm making some changes to the Practicalli AstroNvim configuration (AstroNvim4) over the next few days.</p>\n<p>All my personal Neovim &amp; plugin options (and associated workflow biases) will only be in <code>lua/plugins/practicalli.lua</code>.  With these options only in one file, anyone else using the configuration can easily disable them.</p>\n<p>I will encourage other users to create there own <code>lua/plugins/personal.lua</code> customisation so any changes from upstream will be easier to merge.</p>\n<p>The GitHub repository will be renamed to <code>practicalli/astro-config</code> which its much easier to write and say during screencasts. GitHub should redirect when pulling updates</p>\n<p>This week I will update Practicalli Neovim book install guide with new repo and further info on how to use the config effectively (especially with your own customisations)</p>\n<p>Then the first official release of the config will be created via GitHub releases.</p>\n<p>If I have time, there are lots of things to add to Practicalli Neovim book too (including a few more plugins I'm using in the config)</p>", "image": "https://practical.li/journal/assets/images/social/neovim-on-termux-enhancements.png", "date_published": "2024-06-10T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["neovim", "practicalli"]}, {"id": "https://practical.li/journal/fixing-neovim-treesitter-breaking-changes/", "url": "https://practical.li/journal/fixing-neovim-treesitter-breaking-changes/", "title": "Fixing Neovim Treesitter breaking changes", "content_html": "<p>The sun is out, the sky is blue... and I had the opportunity to understand some Neovim plugins a little more, in order to fix a breaking change with Neovim Treesitter support for Clojure.</p>\n<p>!!! INFO \"Pull Requests this week\"</p>\n<pre><code>- MERGED: [#7 queries: clojure has-type? updated to kind-eq?](https://github.com/PaterJason/nvim-treesitter-sexp/pull/7) for nvim-treesitter-sexp project\n</code></pre>", "image": "https://practical.li/journal/assets/images/social/fixing-neovim-treesitter-breaking-changes.png", "date_published": "2024-06-03T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["astronvim", "github", "neovim", "practicalli", "ssh"]}, {"id": "https://practical.li/journal/multiple-ssh-keys-for-commercial-and-community-work/", "url": "https://practical.li/journal/multiple-ssh-keys-for-commercial-and-community-work/", "title": "Multiple SSH keys for Commercial and Community work", "content_html": "<p>Its easy to go down a rabbit hole of your own making when trying to make something complex work. Taking a step back allows for a much simpler approach to be considered.</p>\n<p>I realised there was a much simpler approach to managing multiple SSH keys, especially when one of those keys is for commercial work that requires Single Sign-On authorisation.</p>", "image": "https://practical.li/journal/assets/images/social/multiple-ssh-keys-for-commercial-and-community-work.png", "date_published": "2024-05-27T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["git", "practicalli"]}, {"id": "https://practical.li/journal/refactor-astronvim-clojure-pack/", "url": "https://practical.li/journal/refactor-astronvim-clojure-pack/", "title": "Refactor AstroNvim Clojure pack", "content_html": "<p>Pull requests this week</p>\n<ul>\n<li>:fontawesome-solid-code-pull-request: <strong>MERGED</strong> <a href=\"https://github.com/folke/ts-comments.nvim/pull/19\">Add Clojure comment patterns to ts-comments.nvim</a></li>\n<li>:fontawesome-solid-code-pull-request: <strong>MERGED</strong> <a href=\"https://github.com/AstroNvim/astrocommunity/pull/982\">Modularise Astrocommunity Clojure pack</a></li>\n<li>:fontawesome-solid-code-pull-request: <strong>MERGED</strong> <a href=\"https://github.com/AstroNvim/astrocommunity/pull/991\">Update AstroNvim Cloure pack description &amp; simplify examples</a></li>\n<li>:fontawesome-solid-code-pull-request: <strong>MERGED</strong> <a href=\"https://github.com/AstroNvim/astrocommunity/pull/992\">Fix vim-visual-multi dependency name</a></li>\n</ul>\n<p>Total commits this week: 37</p>\n<p>Submitted <a href=\"https://github.com/AstroNvim/astrocommunity/pull/982\">a pull request to refactor the AstroNvim Community Clojure language pack</a> which I <a href=\"https://github.com/AstroNvim/astrocommunity/pull/248\">contributed in June 2023</a>.</p>\n<ul>\n<li>add nvim-treesitter-sexp plugin</li>\n<li>add example of disabling / configuring parinfer plugin</li>\n<li>add ts-comment.nvim to support <code>;;</code> and <code>;</code> comment characters</li>\n<li>remove autocmd from conjure plugin (no longer needed)</li>\n<li>remove most of the opinionated conjure configuration overrides, although still hiding the repl log buffer (HUD) by default as its nicer as a separate tab.  Maybe if I can have it open by default as a tab, then I could live with having the HUD open on REPL startup (a nice way to check things are working)</li>\n</ul>\n<p>Still sleepy from travel to the company off-site last week and the cycle ride on Saturday.  Although I did manage some work in the garden on Sunday.</p>", "image": "https://practical.li/journal/assets/images/social/refactor-astronvim-clojure-pack.png", "date_published": "2024-05-20T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["neovim", "practicalli"]}, {"id": "https://practical.li/journal/company-offsite-week/", "url": "https://practical.li/journal/company-offsite-week/", "title": "Company offsite week", "content_html": "<p>Travelled for a work event in Portugal with a chance to meet people I work with face to face for the first time.  It was a very enjoyable and also quite intensive event.  I kept myself busy to help combat fatigue from travelling and manage a swim each morning and evening whilst I was at the hotel.</p>\n<p>I am accustom to working remotely since 2010, having worked for companies based outside of the UK.  It is always very valuable to meet people face to face and can start or strengthen a relationship.</p>", "image": "https://practical.li/journal/assets/images/social/company-offsite-week.png", "date_published": "2024-05-13T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["astronvim", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/gardening-in-the-mornings/", "url": "https://practical.li/journal/gardening-in-the-mornings/", "title": "Gardening in the mornings", "content_html": "<p>A new month so time to update libraries across Practicalli projects.</p>\n<p>Bank holiday Monday and two personal holidays this week, so only two days at work and very few meetings, yay!.  Time to prepare for the company offsite event next week and see how lightly I can pack.</p>\n<p>I made a big impact on upgrading the garden this week.  All the paving stones at the end of the garden were levelled so the shed is no longer on a slope.  A thick weed surpressing membrane was fitted underneath all the paving stones.</p>\n<p>The raised garden bed was be reworked by adjusting the top of the railway sleepers to be level to the top of the paving stones.  This adds a nice clean line with the garden and makes maintenance in and around the garden easier. Weed surpressing membrane was added to the side and underneath of each sleeper.  Spare wood panels was used to keep the membrane in plate and to also add more robustness to the sleepers.</p>\n<p>Most of the work was done in the early mornings as the weather was quite hot.</p>", "image": "https://practical.li/journal/assets/images/social/gardening-in-the-mornings.png", "date_published": "2024-05-06T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/500-commit-streak-on-github/", "url": "https://practical.li/journal/500-commit-streak-on-github/", "title": "500 Commit Streak on GitHub", "content_html": "<p>500 day commit streak on GitHub reached today.  This was legitimately achieved by doing a small amount of work each day.</p>\n<p>I am not actively coding and committing on a regular basis in my current role, so the large majority of these commits are for Practicalli or Open Source projects.</p>\n<p><img alt=\"GitHub stats - 500 day commit streak\" src=\"https://github.com/practicalli/graphic-design/blob/live/github/github-stats-streak-500-days-dark.png?raw=true\"></p>\n<p>Continuing to simplify the Practicalli AstroNvim User Config, so changes from the AstroNvim template are in new files or in <code>community.lua</code>.</p>\n<p>The most visual opinionated changes are in <code>practicalli.lua</code>, such as dashboard logo and theme.</p>\n<p>Motivated to work on the <a href=\"https://practical.li/sustainable-life\">:fontawesome-solid-book-open: Practicalli Sustainable Life</a> book after joining a sustainability working group at the company.</p>", "image": "https://practical.li/journal/assets/images/social/500-commit-streak-on-github.png", "date_published": "2024-04-29T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/practicalli-project-template-updates/", "url": "https://practical.li/journal/practicalli-project-template-updates/", "title": "Practicalli Project Template updates", "content_html": "<p>Adding some nice little improvements to the <a href=\"https://github.com/practicalli/project-templates\">:fontawesome-brands-github: Practicalli Project Templates</a></p>", "image": "https://practical.li/journal/assets/images/social/practicalli-project-template-updates.png", "date_published": "2024-04-22T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/its-april-fool/", "url": "https://practical.li/journal/its-april-fool/", "title": "Its April Fool", "content_html": "<p>Adding SSH keys to the YubiKey hardware security key provides convenience of SSH key use, especially when required for multiple computers.</p>\n<p>Using a YubiKey to keep a single SSH key pair removes the need to generate a key pair for each computer.</p>\n<p>Using one SSH key avoids the need for multiple entries in the allowed-signatures file to check locally that a commit has been signed.</p>", "image": "https://practical.li/journal/assets/images/social/its-april-fool.png", "date_published": "2024-04-01T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["astronvim", "git", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/git-multiple-ssh-keys--neovim/", "url": "https://practical.li/journal/git-multiple-ssh-keys--neovim/", "title": "Git Multiple SSH Keys & Neovim", "content_html": "<p>A short week at work made even shorter by a company day to celebrate going live.  A chance to unwind and reflect.</p>\n<p><a href=\"https://github.com/neovim/neovim/milestones\">Neovim 0.10 is planned for 1 May 2024</a>.  Plugins should be unafected, although actively developing plugins like Neogit are trying to used parts of the Neovim API.  The parts of Neogit that use 0.10 api should be more efficient, although I assume there wont be a noticable difference in functionality.</p>\n<p>I will update Neovim to 0.10 when AstroNvim confirms it is working well with that release.</p>", "image": "https://practical.li/journal/assets/images/social/git-multiple-ssh-keys--neovim.png", "date_published": "2024-03-25T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "git", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/having-a-donut-party-with-system-components/", "url": "https://practical.li/journal/having-a-donut-party-with-system-components/", "title": "Having a Donut Party with system components", "content_html": "<p>Not quite back to full health yet, so took it easy at the weekend.</p>\n<p>More work on restoring spare bicycles so I can sell them or otherwise find a good home.</p>\n<p>Continued the refactor of the Practicalli Service template, specifically refining the design of the system config and helper functions to support a development REPL workflow.</p>", "image": "https://practical.li/journal/assets/images/social/having-a-donut-party-with-system-components.png", "date_published": "2024-03-11T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "donut", "practicalli", "repl-workflow"]}, {"id": "https://practical.li/journal/debian-linux-almost-everywhere/", "url": "https://practical.li/journal/debian-linux-almost-everywhere/", "title": "Debian Linux almost everywhere", "content_html": "<p>Enjoying being back in Debian Linux world, with <a href=\"https://regolith-desktop.com/\">regolith desktop</a> as the tiling window manager.</p>\n<p>I have several Lenovo laptops and all but one are now upgraded to Debian Linux, using the testing version of the distribution.</p>\n<p>The most significant difference with Debian Linux is the use of a separate root account for administration, rather than using <code>sudo</code> in Ubuntu Linux.</p>", "image": "https://practical.li/journal/assets/images/social/debian-linux-almost-everywhere.png", "date_published": "2024-03-10T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/springing-back-into-life-slowly/", "url": "https://practical.li/journal/springing-back-into-life-slowly/", "title": "Springing back into life slowly", "content_html": "<p>The last month has been tough due to illness, although still managed to do a little work with Practicalli to keep me motivated (both for work and my own personal health)</p>\n<p>I though the Practicalli Project Templates had broken when I tried to create a new service project.  It took me an hour or so to realise I had simply been using the command with the wrong argument, doh!</p>", "image": "https://practical.li/journal/assets/images/social/springing-back-into-life-slowly.png", "date_published": "2024-03-04T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/alias-shell-that-updates-shell/", "url": "https://practical.li/journal/alias-shell-that-updates-shell/", "title": "Alias Shell that updates Shell", "content_html": "<p>As this week is mosly tweaks for Zsh history, I've titled this journal entry to be a play on words from the Shakesphere play 'Alls well that ends well'.</p>\n<p>The <code>fd</code> built-in command for Zsh is a very effective way to keep the command history clean.</p>", "image": "https://practical.li/journal/assets/images/social/alias-shell-that-updates-shell.png", "date_published": "2024-02-26T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["clojure", "practicalli"]}, {"id": "https://practical.li/journal/engineering-practices/", "url": "https://practical.li/journal/engineering-practices/", "title": "Engineering Practices", "content_html": "<p>Illness is all around.  Around 12% of people in Germany are currenly ill through covid, flu or a stomach virus.  I have some relatively mild symptoms this week.</p>\n<p>The hunt for a new place to live continues, investigating lots of facinating places in Scotland.  Discovered an Ecopark with sustainably built housing.  There is one house for sale and some new builds in the near future.  Requested a build plan for the new build houses.</p>", "image": "https://practical.li/journal/assets/images/social/engineering-practices.png", "date_published": "2024-02-19T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/the-editors-strike-back/", "url": "https://practical.li/journal/the-editors-strike-back/", "title": "The editors strike back", "content_html": "<p>Interesting edge cases with evil-cleverparens and another question about choice of editor for complete beginners to programming.</p>\n<p>Covid strikes again.  Wiped out by the end of the week.</p>", "image": "https://practical.li/journal/assets/images/social/the-editors-strike-back.png", "date_published": "2024-02-12T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/striving-toward-consistency/", "url": "https://practical.li/journal/striving-toward-consistency/", "title": "Striving toward consistency", "content_html": "<p>Will feel good to have all Practicalli website content have a consisten look.</p>\n<p>Material for MkDocs really helps me convey information effectively (at least in my own view).</p>\n<p>Still have a few covid symptoms, but not as much this week.  Usually only in the mornings.</p>", "image": "https://practical.li/journal/assets/images/social/striving-toward-consistency.png", "date_published": "2024-02-05T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/no-one-is-omnipotent/", "url": "https://practical.li/journal/no-one-is-omnipotent/", "title": "No one is omnipotent", "content_html": "<p>Understand what is the most valuable thing and focus on attaing it.</p>\n<p>Technical writing is a skill that regularly needs practice.</p>", "image": "https://practical.li/journal/assets/images/social/no-one-is-omnipotent.png", "date_published": "2024-01-29T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/quiet-before-the-storm/", "url": "https://practical.li/journal/quiet-before-the-storm/", "title": "Quiet before the storm", "content_html": "<p>Its not as windy as previous weeks, but there is another storm on its way.</p>\n<p>Feeling too tired for exercise over the weekend, need to pace myself at work a little better.</p>\n<p>Hopefully as the weather gets warmer or at least sunnier it will be easier to do more outside activities.</p>", "image": "https://practical.li/journal/assets/images/social/quiet-before-the-storm.png", "date_published": "2024-01-22T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/warmer-weather/", "url": "https://practical.li/journal/warmer-weather/", "title": "Warmer weather", "content_html": "<p>Practicalli AstroNvim User Config changed to be as additive as possible, leaving the template as unchanged as possible.</p>\n<p>The sunnier weather is a boots to motivation, although its still very windy.  At least I can get into the garden without sinking.</p>\n<p>Another Saturday morning ride, a tough experience although not completely exhausted afterward.</p>", "image": "https://practical.li/journal/assets/images/social/warmer-weather.png", "date_published": "2024-01-15T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["astronvim", "clojure", "neovim", "practicalli"]}, {"id": "https://practical.li/journal/breaking-ground-on-the-new-year/", "url": "https://practical.li/journal/breaking-ground-on-the-new-year/", "title": "Breaking ground on the new year", "content_html": "<p>Rushing work is the slowest way to make progress.</p>\n<p>Exhausted after this week of work, so took a break from cycling and running.  Lots of cat naps over the weekend.</p>", "image": "https://practical.li/journal/assets/images/social/breaking-ground-on-the-new-year.png", "date_published": "2024-01-08T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/a-new-year-a-new-me/", "url": "https://practical.li/journal/a-new-year-a-new-me/", "title": "A new year... a new me", "content_html": "<p>Going back to work for a rest... from all the exercise of winter solstace</p>\n<p>Continuing to love using Neovide, although havent figured out how to use Neovide from the MacOSX launcher with AstroNvim. It works fine under Linux.</p>", "image": "https://practical.li/journal/assets/images/social/a-new-year-a-new-me.png", "date_published": "2024-01-01T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/end-of-line-for-2023/", "url": "https://practical.li/journal/end-of-line-for-2023/", "title": "End of line... for 2023", "content_html": "<p>My personal plans for 2024 are not set in stone, but I would like to relocate to the countryside by the summer.</p>\n<p>Predictions for 2024:</p>\n<ul>\n<li>the year of the AI lawsuits as more companies and individuals realise they content has been used to train AI models without permission or recompense.</li>\n<li>Anthropocene is declared a new geographic era in the history of the earth, marking the significant change humanity has made to the planet (not for the good).</li>\n</ul>", "image": "https://practical.li/journal/assets/images/social/end-of-line-for-2023.png", "date_published": "2023-12-31T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/practicalli-work-over-the-winter-break/", "url": "https://practical.li/journal/practicalli-work-over-the-winter-break/", "title": "Practicalli work over the winter break", "content_html": "<p>The company I work for takes a break over the winter, so I have some time to spend on Practicalli content.</p>", "image": "https://practical.li/journal/assets/images/social/practicalli-work-over-the-winter-break.png", "date_published": "2023-12-24T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/neovim-updates-and-neovide/", "url": "https://practical.li/journal/neovim-updates-and-neovide/", "title": "Neovim updates and Neovide", "content_html": "<p>Enjoying the new role as there is so much to do that I can get involved with.</p>\n<p>Also enjoying Neovide GUI for Neovim, although its more convienient to simply run <code>astro</code> for Neovim in a terminal.  When I am comfortable setting the base directory or working with multiple project, then Neovide will be more convienient to use.</p>", "image": "https://practical.li/journal/assets/images/social/neovim-updates-and-neovide.png", "date_published": "2023-12-17T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/weekly-journal--neovide/", "url": "https://practical.li/journal/weekly-journal--neovide/", "title": "Weekly journal & Neovide", "content_html": "<p>The Practicalli journal will move to a weekly cadence now I have a full time job with Griffin Bank.</p>\n<p>I do write a daily journal for my activities in Griffin and will share information that is not sensitive or business valuable.</p>", "image": "https://practical.li/journal/assets/images/social/weekly-journal--neovide.png", "date_published": "2023-12-09T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/visiting-the-new-office/", "url": "https://practical.li/journal/visiting-the-new-office/", "title": "Visiting the new office", "content_html": "<p>Party on dudes...</p>", "image": "https://practical.li/journal/assets/images/social/visiting-the-new-office.png", "date_published": "2023-12-06T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/on-boarding-at-the-new-job/", "url": "https://practical.li/journal/on-boarding-at-the-new-job/", "title": "On-boarding at the new job", "content_html": "<p>Balancing enthusiasm to be productive with learning enough first so as not to be dangerous</p>", "image": "https://practical.li/journal/assets/images/social/on-boarding-at-the-new-job.png", "date_published": "2023-12-05T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}, {"id": "https://practical.li/journal/first-day-at-the-new-company/", "url": "https://practical.li/journal/first-day-at-the-new-company/", "title": "First day at the new company", "content_html": "<p>How does it feel to be employed... wonderful.</p>", "image": "https://practical.li/journal/assets/images/social/first-day-at-the-new-company.png", "date_published": "2023-12-04T00:00:00+00:00", "authors": [{"name": "practicalli"}], "tags": ["practicalli"]}]}